# 算术运算符：+ - * /  // %  **
# print("10+3=",10+3) #加 13
# print("10-3=",10-3) #减 7
# print("10*3=",10*3) #乘 30
# print("10/3=",10/3) #除 3.3333 注意:除法运算出的结果
# print("10//3=",10//3) #整除 3
# print("10%3=",10%3)  #取余/求模 1
# print("10**3=",10**3) #幂指数10的3次方，1000

# 算术运算符的优先级--> ** --> * / // % --> + -
# print("0.1+10/4**2=",0.1+10/4**2)

# 案例：输入两个数x和y，计算x+y 和 x-y 的结果并输出
# --->方法1：运算时变量转为int,但是有局限性，如果想输入一个小数并计算则会报错
# x = int(input("请输入x的值："))
# y = int(input("请输入y的值："))
# print("x+y=",x+y)
# print("x-y=",x-y)

# --->方法2：可以转换成float()
# x = float(input("请输入x的值："))
# y = float(input("请输入y的值："))
# print("x+y=",x+y)
# print("x-y=",x-y)

# x=0.5，y=0.4
# x-y= 0.09999999999999998
# x-y= 0.09999999999999998-->出现运算错误是属于正常情况-->精度损失：由于计算机底层是基于二进制进行数据的存储与处理的，二进制无法准确表示所有的小数，因此涉及到浮点数的运算，可能会损失精度

# 练习1：计算输入的3个整数的平均数
# num1 = int(input("请输入第一个数："))
# num2 = int(input("请输入第二个数："))
# num3 = int(input("请输入第三个数："))
# print(f"这三个数的平均值为：{(num1 + num2 + num3)/3}")

# 答案：
# num1 = int(input("请输入第一个数："))
# num2 = int(input("请输入第二个数："))
# num3 = int(input("请输入第三个数："))
# avg_data = (num1+num2+num3)/3
# print(f"{num1},{num2},{num3},这三个数的平均值为：{avg_data}")

# 练习2：输入梯形的上底、下底、高，计算梯形的面积
# --->方法1:
# a = float(input("输入梯形的上底a:"))
# b = float(input("输入梯形的下底b:"))
# h = float(input("输入梯形的高h:"))
# s = (a+b)*h/2
# print(f"梯形的面积为:{s}")

# --->方法2：
# a = float(input("输入梯形的上底a:"))
# b = float(input("输入梯形的下底b:"))
# h = float(input("输入梯形的高h:"))
# print(f"梯形的面积为:{(a+b)*h/2}")

# 练习3：输入圆的半径，计算圆的周长和面积（周长：2Πr,面积：Πr²）
# r = float(input("输入圆的半径："))
# print(f"圆的周长为：{2*3.14*r}")
# print(f"圆的面积为：{3.14*r**2}")

# 练习4：身体质量指数BMI的计算  BMI = 体重（kg）/身高（m）²
# 1. 输入体重（单位kg）
# weight = float(input("请输入体重:"))
# # 2. 输入身高（单位m）
# high = float(input("请输入身高："))
# # 3.计算身体质量指数BMI并输出
# print(f"BMI={weight/high**2}")

# 赋值运算符---> =  +=  -=  *=  /=  //=  %=  **=
# num = 85
# num += 10 # num = num + 10
# print("num += 10 后，num = ",num)  # 95
# num -= 10 # num = num - 10
# print("num -= 10 后,num = ",num)  # 85
# num *= 10 # num = num * 10
# print("num *= 10 后,num =",num)  # 850
# num /= 10 # num = num /10
# print("num /= 10 后,num =",num)  # 85.0
# num //= 10 # num = num // 10
# print("num //= 10 后,num =",num)  # 8.0
# num %= 3 # num = num % 3
# print("num %= 3 后,num =",num)  #  2.0
# num **= 3 # num = num ** 3
# print("num **= 3 后,num =",num)  # 8.0

# 比较/关系运算符---->  ==  !=  >  >=  <  <=  ----> 比较运算符两边表达式的大小，比较关系成立则返回一个bool：True，否则：False
# print("100==100吗：",100==100) # True
# print("'100'=='100'吗：",'100'=='100') # True
# print("100!=100吗：",100!=100) # False
#
# print("100>100吗：",100>100) # False
# print("100>=100吗：",100>=100) # True
#
# print("100<100吗：",100<100) # False
# print("100<=100吗：",100<=100) # True

# 逻辑运算符---> 用于连接多个bool表达式（True或False）并返回一个bool ---> and  or  not
# 案例1：键盘输入一个整数，判断其是否在10-20之间--> 在：True， 不在：False
# a = int(input("请输入一个整数："))
# print(f"{a}在10-20之间：", a>=10 and a<=20) # 需要 a>=10 和 a<=20 同时成立
# 简化后的式子：
# print(f"{a}在10-20之间：", 10 <= a <= 20)


# 案例2：键盘输入一个整数，判断其是否不在10-20之间-->
a = int(input("请输入一个整数："))
print(f"{a}不在10-20之间：", a<10 or a>20) #  a<10 或 a>20 其中一个成立即为True