"""
元组：是不可变的序列，类似于列表，但是创建后不能修改
特点： 1、可以存储不同类型的元素
      2、元素可以重复、有序，不可以修改（支持索引访问、切片）
定义：元组名称 = (元素1,元素2,元素3,....)
定义空元组:
元组名称 = ()
或者
元组名称 = tuple()  #调用tuple函数来定义空元组

常见方法:
count():统计元素在元组中出现的次数
index():查询某个元素在元组中的索引位置(第一次出现的位置),元素不存在则报错
"""

#------------------------元组-基本操作---------------------------------------
# 定义:
# t1 = (11,34,43,"ww",44,[1,3,"ddd"],98,11,34,0)
# print(t1)
# print(type(t1))
# # 索引访问:
# print(t1[0])
# print(t1[3])
# # 切片:
# print(t1[0:5:1])
# print(t1[:5])
#
# # 元组的常用方法:
# # count():统计元素的个数
# print(t1.count(11))
# # index():获取元素的索引(第一个索引到的位置),如果元素不存在则报错
# print(t1.index(34))
#
# # 注意点: 如果定义单个元素的元组,元素后面要加逗号,比如(100,)
# t1 = (100)  # 不加逗号时,会默认为是一个普通的括号,等同于 t1 = 100
# print(t1)
# print(type(t1)) # 返回的类型不是元组,而是int
#
# t1 = (100,)
# print(t1)
# print(type(t1))
#
# # ----------------------------------元组-解包与组包-------------------------------------
# # 组包:将多个值合并到一个容器中(列表、元组)
# # 定义元组就是一个组包的过程
# t1 = (12,22,34,45)  #推荐使用这种写法
# t2 = 12,22,34,45  #另一种写法，没有括号，系统也默认为是元组
# print(t1)
# print(t2)


# 解包：将容器（列表、元组）解开成独立的元素，分别赋值给多个变量
# 基础解包
# a,b,c,d = t1# 将元组t1解开，定义a,b,c,d四个变量来接收元组中的元素，即a = 12  b = 22  c = 34  d = 45,t1中有多少个元素，就定义多少个变量来接收
# print(a,b,c,d)
# # 扩展解包（*）---> *表示收集元组中剩余的元素，允许我们处理不确定数量的元素（生成列表，以便可以进行进一步处理）
# x,*y,z = t1  # x = 12  y = [22,34]  z = 45
# print(x,y,z)
# s,*o = t1  # s = 12  o = [22,34,45]
# print(s,o)
# *p,e = t1  # p = [12,22,34]  e = 45
# print(p)
# print(e)

# -------------------------------案例-----------------------------------------------------
# 案例1:现有2个变量，分别为 a = 10 , b = 20 ，现需要将两个变量的值进行交换，然后输出到控制台
# a = 10
# b = 20
# """
# 分步骤：
#  1.组包
# t = b,a
#  2.解包
# a,b = t
# """
# a,b = b,a  #直接一步到位的写法，一行代码直接执行了组包和解包的操作
# print(a)
# print(b)
#
# # 案例2：现有3个变量，分别为：a = 100, b = 200, c = 300,现需要将3个变量值进行交换，将a,b,c的值分别赋值给c,a,b，输出到控制台
# a = 100
# b = 200
# c = 300
# c,a,b = a,b,c
# print(a)
# print(b)
# print(c)

# ------------------------------------------综合案例-------------------------------------
"""
根据如下提供的学生成绩单，完成如下需求：
    1.计算每个学生的总分、各科平均分，然后一并输出出来。
    2.统计各科成绩的最低分、最高分、平均分，并输出。
    3.查找成绩优秀（平均分大于90）的学生，并输出。
"""
"""
学号     姓名     语文     数学     英语
S001    王琳      85      92      78
S002   李小龙     92      88      95
S003    十三      87      90      86
S004   吴嘉莉     95      89      98
S005    曾韵      96      90      99
S006   曾轶可     80      86      87
S007    麻园      88      96      87
S008    甜甜      80      99      90
S009    五百      85      97      96
S010   许大脚     95      95      91
"""
"""
解题思路：
存储学生的信息，每一行为一个信息，可以用一个元组来表示，全部信息也可以用元组表示，那就可以进行元组的嵌套。为什么用元组？因为学生的成绩一旦录入，不可修改。
"""
students = (
    ("S001","王琳",85,92,78),
    ("S002","李小龙",92,88,95),
    ("S003","王琳",85,92,78),
    ("S004","吴嘉莉",95,89,98),
    ("S005","曾韵",96,90,99),
    ("S006","曾轶可",80,86,87),
    ("S007","麻园",88,96,87),
    ("S008","甜甜",80,99,90),
    ("S009","五百",85,97,96),
    ("S010","许大脚",95,95,91)
)

# 1.计算每个学生的总分、各科平均分，然后一并输出出来。---> avg:.1f ---> 这里是对平均分保留1位小数处理，冒号代表对前面的元素进行解释，.1表示保留1位小数，f是avg的数据类型float
print("学号 \t 姓名 \t 语文 \t 数学 \t 英语 \t 总分 \t 平均分")  #表头
# 方法1：索引
# for i in students:
#     total = i[2]+i[3]+i[4]
#     avg = total / 3
#     print(f"{i[0]} \t {i[1]} \t {i[2]} \t {i[3]} \t {i[4]} \t {total} \t {avg:.1f}")
"""
上面使用索引的方法，代码可读性比较弱，如果不熟悉元组的结构，写到后面会不知道自己写的是什么（0，1，2，3这些数字代表什么呢？
那么可以通过元组解包的方式，给元组内的值分别赋值给对应的变量，可以更直观，比如id="序号"、name="姓名"等，不用看原来的元组，也知道是什么。
👇👇👇👇
"""
# 方法2：元组解包
for id,name,chinese,math,english in students:
    total = chinese + math + english
    avg = total / 3
    print(f"{id} \t {name} \t {chinese} \t {math} \t {english} \t {total} \t {avg:.1f}")
print("-------------------------------------------------------")

# 2.统计各科成绩的最低分、最高分、平均分，并输出。
# 2.1获取各科成绩的列表
chinese_scores = [i[2]for i in students]  # 使用了列表推导式，形成一个各科的成绩列表
math_scores = [i[3]for i in students]
english_scores = [i[4]for i in students]
# 2.2统计各科成绩的最低分、最高分、平均分
print("学科 \t 最低分 \t 最高分 \t 平均分")  #表头
print(f"语文 \t {min(chinese_scores)} \t {max(chinese_scores)} \t {sum(chinese_scores)/len(chinese_scores)}")
print(f"数学 \t {min(math_scores)} \t {max(math_scores)} \t {sum(math_scores)/len(math_scores)}")
print(f"英语 \t {min(english_scores)} \t {max(english_scores)} \t {sum(english_scores)/len(english_scores)}")
print("-------------------------------------------------------")

# 3.查找成绩优秀（平均分大于90）的学生，并输出。
print("成绩优秀（平均分大于90）的学生名单如下：")
# 方法1：索引
# print("学号 \t 姓名 \t 平均分")
# for i in students:
#     total = i[2] + i [3] + i[4]
#     avg = total / 3
#     if avg > 90:
#         print(f"{i[0]} \t {i[1]} \t {avg:.1f}")

# 方法2：元组解包
print("学号 \t 姓名 \t 平均分")
for id,name,chinese,math,english in students:
    total = chinese + math + english
    avg = total / 3
    if avg > 90:
        print(f"{id} \t {name} \t {avg:.1f}")